; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   microwavetype sinkbasintype fridgetype - receptacletype
   knifetype butterknifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   coffeemachinetype stoveburnertype coffeetabletype - receptacletype
   saltshakertype pantype alarmclocktype clothtype bowltype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   sinkbasin_1 microwave_2 coffeemachine_3 stoveburner_4 coffeetable_5 microwave_6 fridge_7 - receptacle
   saltshaker_1 pan_2 alarmclock_3 cloth_4 bowl_5 - obj
 )
 (:init (receptacletype_0 sinkbasin_1 sinkbasintype) (receptacletype_0 microwave_2 microwavetype) (receptacletype_0 coffeemachine_3 coffeemachinetype) (receptacletype_0 stoveburner_4 stoveburnertype) (receptacletype_0 coffeetable_5 coffeetabletype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 saltshaker_1 saltshakertype) (objecttype_0 pan_2 pantype) (objecttype_0 alarmclock_3 alarmclocktype) (objecttype_0 cloth_4 clothtype) (objecttype_0 bowl_5 bowltype) (cancontain sinkbasintype pantype) (cancontain sinkbasintype clothtype) (cancontain sinkbasintype bowltype) (cancontain microwavetype bowltype) (cancontain stoveburnertype pantype) (cancontain coffeetabletype saltshakertype) (cancontain coffeetabletype pantype) (cancontain coffeetabletype alarmclocktype) (cancontain coffeetabletype clothtype) (cancontain coffeetabletype bowltype) (cancontain fridgetype pantype) (cancontain fridgetype bowltype) (pickupable saltshaker_1) (pickupable pan_2) (isreceptacleobject pan_2) (cleanable pan_2) (coolable pan_2) (pickupable alarmclock_3) (pickupable cloth_4) (cleanable cloth_4) (pickupable bowl_5) (isreceptacleobject bowl_5) (cleanable bowl_5) (coolable bowl_5) (receptacleatlocation sinkbasin_1 location4) (receptacleatlocation microwave_2 location5) (receptacleatlocation coffeemachine_3 location1) (receptacleatlocation stoveburner_4 location1) (receptacleatlocation coffeetable_5 location3) (receptacleatlocation microwave_6 location2) (receptacleatlocation fridge_7 location2) (inreceptacle saltshaker_1 coffeetable_5) (inreceptacle pan_2 sinkbasin_1) (inreceptacle alarmclock_3 coffeetable_5) (inreceptacle cloth_4 coffeetable_5) (inreceptacle bowl_5 fridge_7) (objectatlocation saltshaker_1 location3) (objectatlocation pan_2 location4) (objectatlocation alarmclock_3 location3) (objectatlocation cloth_4 location3) (objectatlocation bowl_5 location2) (atlocation agent1 location2) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o - obj)
 (and (coolable ?o) (objecttype_0 ?o bowltype) (receptacletype_0 ?r coffeetabletype) (iscool ?o) (inreceptacle ?o ?r))))))
 (:metric minimize (total-cost))
)

; plan
1. (pickupobject agent1 location2 bowl_5 fridge_7)
   deleted: (inreceptacle bowl_5 fridge_7) (objectatlocation bowl_5 location2)
   added: (holds agent1 bowl_5) (holdsany agent1)
   goals met: 0 of 1
2. (coolobject agent1 location2 fridge_7 bowl_5)
   added: (iscool bowl_5)
   goals met: 0 of 1
3. (gotolocation agent1 location2 location3)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
4. (putobject agent1 location3 bowl_5 coffeetable_5 bowltype coffeetabletype)
   deleted: (holds agent1 bowl_5) (holdsany agent1)
   added: (inreceptacle bowl_5 coffeetable_5) (objectatlocation bowl_5 location3)
   goals met: 1 of 1
